# a = 548
# b = 642
# c = 324
#
# numbers = a < b < c
#
# print(numbers)
#
#



# a = 1234
# b = 1234 // 1000
# c = 1234 % 1000
# d = c // 10
# e = c % 10
# print (b, d, e)
# print(b != d or b != e or d != e)



# # Задаем четырехзначное число
# number = 1234
#
# # Извлекаем цифры из числа
# b = number // 1000           # Первая цифра (тысячи)
# c = number % 1000            # Оставшееся число после извлечения тысяч
# d = c // 100                 # Вторая цифра (сотни)
# e = c % 100                  # Оставшееся число после извлечения сотен
# f = e // 10                  # Третья цифра (десятки)
# g = e % 10                   # Четвертая цифра (единицы)
#
# # Печатаем извлеченные цифры
# print(b, d, f, g)
#
#
# print(b != d or b != f or b != g or d != f or d != g or f != g)











# number = 1234
# a = number // 1000      # Первая цифра (тысячи)
# b = (number % 1000) // 100  # Вторая цифра (сотни)
# c = (number % 100) // 10     # Третья цифра (десятки)
# d = number % 10             # Четвертая цифра (единицы)
#
# is_increasing = a < b and b < c and c < d
#
# print(a, b, c, d)
# print(is_increasing)




# # Ввод значения от пользователя
# meaning = int(input("Введите значение: "))
#
# # Определяем диапазон для сулинка тугопластичного легкого
# range_min = 0
# range_max = 10
#
# # Проверка, принадлежит ли значение категории
# meaning = (range_min <= meaning <= range_max)
#
# # Вывод результата
# print("Принадлежит категории сулинок тугопластичный легкий:", meaning)




# Запрос значений у пользователя
plasticity = int(input("Введите число пластичности: "))
liquid = float(input("Введите показатель текучести в долях единиц: "))

# Определение типа грунта на основе введенных данных
if 1 <= plasticity <= 7:
    soil_type = "Супесь"
elif 7 < plasticity <= 17:
    soil_type = "Суглинок"
elif plasticity > 17:
    soil_type = "Глина"
else:
    print("Некорректное значение числа пластичности")


# Определение текстуры грунта на основе показателя текучести
if liquid < 0:
    texture = "твердая"
elif 0 <= liquid <= 0.25:
    texture = "полутвердая"
elif 0.25 < liquid <= 0.50:
    texture = "тугопластичная"
elif 0.50 < liquid <= 0.75:
    texture = "мягкопластичная"
elif 0.75 < liquid <= 1:
    texture = "текучепластичная"
else:
    texture = "текучая"

# Вывод типа грунта
print(f"{soil_type} {texture}")